Ａ／Ｄ変換器　アナログ信号(入力装置）からデジタル信号（PC)に変換

Ｄ／A変換器　デジタル信号（PC)からアナログ信号(出力装置）に変換

サンプリング　一定の間隔で周波数をとる。サンプリング周波数、１秒間で取り出す回数

フーリエ変換　信号を複数の周波数の波に分解して表現　雑音撤去に使う

フイルタ　信号から必要な周波数を取り出す

HPF (high pass filter) highpass(高い周波数のを通す）それ以下はとりのぞく

LPF(Low Pass Filter)lowpass(低い周波数の通す）それ以上は取り除く

BPF　(band pass filter)bandpass(ある周波数通す）それ以外は取り除く

ダイクストア　隣接する場所の最短距離を毎回求めて、あるところへまでの最短距離を求める。カーナビに使われている

システムはMVCモデルを用いるのが普通

Model DBにアクセスし、データの挿入、更新、取得ができる

View ユーザに応じて、動的ペーじ作成しユーザに送る

Controller ユーザの要求受けて、DB呼び出して、Viewに要求する(controllerをはさんでmodelとviewを扱うことでmodel,viewを直しやすい(つながってないから））

リッチ（rich)クライアント 　複雑な処理機能を持ったクライアント

Ajax (javascript+XML) 画面遷移せずにWebページのコンテンツを書き換えること(非同期通信)検索するとき検索候補がでる

SNSでメッセージ送ると、DBに登録されるが画面変わらずにメッセージ表示

Apache Webサーバーの仕組みを持ったフリーのソフトウェア

HTML5 canvas Webページに図形を書ける、Websocket　サーバと定期的に通信する

Geolocation API ユーザの位置情報(GPS)を扱う事　などの機能がある

SPA １つのWebページで複数のアプリケーションを構成すること

オーバレイ　補助記憶装置から必要なものを読み込みながら動作。主記憶装置の容量に制限があるときにおすすめ

プログラムはプログラム実行時呼び出されるmain関数持つ、メインルーチン、メインルーチンの中から呼び出されるサブルーチンを持つ

継承(インヘリタンス）スーパークラスから性質をサブクラスに引き継がせること

多相性(ポリモーフィズム）サブクラスごとに同じ名前のメソッドで処理は異なるものを用意し、呼び出すとき特に気にしなくてもいいようにすること

静的リンク　実行に必要なライブラリなどを実行ファイルの内部にすべて連結しておく

動的リンク　実行時に実行に必要なライブラリなどを実行ファイルの内部にすべて連結

コーティング規約の命令規則　変数名をわかりやすいものにする

プログラム機能適合性　プログラムにニーズを満足させる性能を持たせること

プログラムの性能効率性　プログラムが時間内に要求された結果を返すこと

プログラムの使用性　利用者がプログラムを理解し利用しやすいこと

プログラムの保守性　プログラムの修正のしやすさ

リエント（entry=入場)ラント(=ランド(複数））（再入可能）複数のプログラムから呼び出されてもそれぞれに正しい結果を返せること

リカ(リカバリー=復活）ーシブ(再帰(復帰）可能）自分自身をプログラム内で呼び出せる

リロケータブル（再配置可能）HW(ハードウェア）のメモリのどこに置いても使える

リユーザ(使用する人）ブル(再使用可能）プログラム終了時もう１回実行する